#include <stdio.h>
// 企业根据利润发放提成奖金.设提成奖金为y,利润为x(单位:万元),计算公式如下:
// 参照自考书籍<<高级语言程序设计>> 2017版 第121页-例4-23题
// 要求: 从键盘输入当月利润,计算并输出应发的提成奖金.

// 计算奖金
int countBonus(int x)
{
	int y;
	if(x<10){
		x=10000*x;
		y=x*0.1;
	}else if(10<x<=20){
		x=10000*x;
		y=10*0.1+(x-10)*0.075;
	}else if(20<x<=40){
		x=10000*x;
		y=10*0.1+10*0.075+20*0.05;
	}else if(40<x<=60){
		x=10000*x;
		y=10*0.1+10*0.075+20*0.05+(x-40)*0.03;
	}else if(60<x<=100){
		x=10000*x;
		y=10*0.1+10*0.075+20*0.05+20*0.03+(x-60)*0.015;
	}else if(x>100){
		x=10000*x;
		y=10*0.1+10*0.075+20*0.05+20*0.03+(x-60)*0.015+(x-100)*0.01;
	}
	return y;
}

// 主函数
int main(void)
{
	int x,y;
	printf("请输入当月的利润(单位:万元):");
	scanf("%d",&x);
	y=countBonus(x);
	printf("当月的奖金为:%d\n",y);
	return 0;
}
